# Αντικειμενοστραφής Προγραμματισμός -> Object Oriented Programming(OOP)

# Τα δύο βασικά πράγματα από τα οποία θα αποτελείται ένα μοντέλο
# είναι τα ΧΑΡΑΚΤΗΡΙΣΤΙΚΑ του και οι ΛΕΙΤΟΥΡΓΙΕΣ του

# Τα χαρακτηριστικά (attributes) τα αποθηκεύουμε σε μεταβλητές
# Τις λειτουργίες (methods) του τις αναπαριστούμε με συναρτήσεις

# Το μοντέλο που θα χρησιμοποιήσουμε είναι η αποτύπωση
# ενός αυτοκινήτου με κώδικα

# Όλα αυτά τα χαρακτηριστικά και τις λειτουργίες τις συγκεντρώνουμε
# μαζί σε μία οντότητα που ονομάζεται κλάση (class)

# Η κλάση είναι ένα γενικό καλούπι!
# Οι υλοποιήσεις της κλάσης ονομάζονται αντικείμενα(objects)
# και έχουν ξεχωριστή ταυτότητα, αλλά υπακούν στους γενικούς
# κανόνες που έχουμε ορίσει στην κλάση.

def add(x, y):
    return x+y

class Car:
    """A simple attempt to represent a car"""

    def __init__(self, make, model, year):
        """Initilize attributes to describe the car"""
        self.make = make
        self.model = model
        self.year = year


